[GIJoeBlackoutBronzeBettyAssaultRifle X2WeaponTemplate]
FriendlyName="黑夜工人"
FriendlyNamePlural="GIJoeBlackoutBronzeBettyAssaultRifle"
BriefSummary="We've managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage once we perfect modular weapon technology."
TacticalText="<Bullet/> 在没有特殊训练的情况下，使用主武器攻击会结束士兵的回合。\n<Bullet/> 通过配件改造来提升黑夜工人的战斗力。（LWOTC禁用升级）"
AbilityDescName="黑夜工人"

